Revit 2027 API
Alignment.GetPointAtStation Method
 Calculates the model point for a given alignment station.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetPointAtStation(
	double station
)
Public Function GetPointAtStation (
	station As Double
) As XYZ
public:
XYZ^ GetPointAtStation(
	double station
)
member GetPointAtStation :
        station : float -> XYZ
Parameters
station Double
The alignment station for which to calculate the point, in Revit internal model units (standard Imperial feet).
Return Value
XYZ
The model point at the given alignment station.
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace